loadTestGET.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: "warm up the application"
    - duration: 10
      arrivalRate: 10
      name: "warm up the application"
    - duration: 10
      arrivalRate: 50
      name: 'stage 1'
    - duration: 10
      arrivalRate: 100
      name: 'stage 2'
    - duration: 10
      arrivalRate: 200
      name: 'stage 3'

scenarios:
  - flow:
    - loop:
      - get:
          url: "/{{ $loopElement }}/rec-Photos"
      over:
        - "335345"
        - "345566"
        - "3256677"
        - "9944356"
        - "9569496"