loadTestGET.yml
config:
  target: "http://localhost:3002"
  http:
    timeout: 10

  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: "warm up the application"
    - duration: 10
      arrivalRate: 10
      name: "warm up the application"
    - duration: 10
      arrivalRate: 50
      name: 'stage 1'
    - duration: 10
      arrivalRate: 100
      name: 'stage 2'
    - duration: 10
      arrivalRate: 200
      name: 'stage 3'
    - duration: 10
      arrivalRate: 400
      name: 'stage 4'
    - duration: 10
      arrivalRate: 600
      name: 'stage 5'
    - duration: 10
      arrivalRate: 900
      name: 'stage 5'
  processor: "./artilleryHelpFunc.js"


scenarios:
  - flow:
    - function: "generateRandomListingId"
    - get:
        url: "/{{ listingId }}/rec-Photos"